//
//  LocationList.swift
//  TidesBackEnd
//
//  Created by 劉洧熏 on 2017/4/17.
//  Copyright © 2017年 劉洧熏. All rights reserved.
//

import Foundation

struct LocationList {
    
    let citys =
        ["基隆市", "新北市", "桃園縣", "新竹縣", "新竹市", "苗栗縣", "臺中市", "彰化縣", "雲林縣", "嘉義縣", "臺南市", "高雄市", "屏東縣", "臺東縣", "花蓮縣", "宜蘭縣", "澎湖縣", "連江縣", "金門縣"]

    let citysCode =
        ["F-D0047-049", "F-D0047-069", "F-D0047-005", "F-D0047-009", "F-D0047-053", "F-D0047-013", "F-D0047-073", "F-D0047-017", "F-D0047-025", "F-D0047-029", "F-D0047-077", "F-D0047-065", "F-D0047-033", "F-D0047-037", "F-D0047-041", "F-D0047-001", "F-D0047-045", "F-D0047-081", "F-D0047-085"]
    
    let towns = [
        "基隆市": ["中正區", "中山區", "安樂區"],
        "新北市": ["萬里區", "金山區", "瑞芳區", "貢寮區", "林口區", "八里區", "淡水區", "三芝區", "石門區"],
        "連江縣": ["南竿鄉", "北竿鄉", "莒光鄉", "東引鄉"],
        "宜蘭縣": ["頭城鎮", "壯圍鄉", "五結鄉", "蘇澳鎮", "南澳鄉"],
        "新竹市": ["香山區", "北區"],
        "新竹縣": ["竹北市", "新豐鄉"],
        "桃園縣": ["新屋鄉", "觀音鄉", "大園鄉", "蘆竹鄉"],
        "苗栗縣": ["竹南鎮", "後龍鎮", "通霄鎮", "苑裡鎮"],
        "臺中市": ["龍井區", "梧棲區", "清水區", "大甲區", "大安區"],
        "彰化縣": ["鹿港鎮", "福興鄉", "線西鄉", "伸港鄉", "大城鄉", "芳苑鄉"],
        "嘉義縣": ["東石鄉", "布袋鎮"],
        "雲林縣": ["臺西鄉", "麥寮鄉", "口湖鄉", "四湖鄉"],
        "臺南市": ["南區", "安平區", "安南區", "七股區", "將軍區", "北門區"],
        "高雄市": ["鼓山區", "旗津區", "前鎮區", "楠梓區", "小港區", "左營區", "梓官區", "彌陀區", "永安區", "林園區", "茄萣區"],
        "澎湖縣": ["馬公市", "西嶼鄉", "望安鄉", "七美鄉", "白沙鄉", "湖西鄉"],
        "金門縣": ["金沙鎮", "金湖鎮", "金寧鄉", "金城鎮", "烈嶼鄉", "烏坵鄉"],
        "屏東縣": ["枋山鄉", "車城鄉", "牡丹鄉", "恆春鎮", "滿州鄉", "新園鄉", "東港鎮", "琉球鄉", "林邊鄉", "佳冬鄉", "枋寮鄉"],
        "臺東縣": ["臺東市", "綠島鄉", "蘭嶼鄉", "卑南鄉", "東河鄉", "成功鎮", "長濱鄉", "太麻里鄉", "大武鄉", "達仁鄉"],
        "花蓮縣": ["花蓮市", "新城鄉", "秀林鄉", "吉安鄉", "壽豐鄉", "豐濱鄉"]
    ]
}
